server.port=8083

spring.kafka.consumer.bootstrap-servers=localhost:9092
spring.kafka.consumer.group-id=group-id
spring.kafka.consumer.auto-offset-reset=latest
spring.kafka.consumer.enable-auto-commit=true
spring.kafka.consumer.auto-commit-interval=1000
spring.kafka.consumer.key-deserializer=org.apache.kafka.common.serialization.StringDeserializer
spring.kafka.consumer.value-deserializer=org.apache.kafka.common.serialization.StringDeserializer

spring.mail.host=smtp.mail.ru
spring.mail.port=465
spring.mail.username=credit.conveyor@mail.ru
spring.mail.password=nf11LhMNVkTz7juQNvVG
spring.mail.properties.mail.smtp.auth=true
spring.mail.properties.mail.smtp.starttls.enable=true
spring.mail.properties.mail.smtp.starttls.required=true
spring.mail.properties.mail.smtp.ssl.enable=true

custom.integration.deal.get.credit=http://localhost:8081/deal/applicationDto/{id}

link.finish.registration=http://localhost:7777/swagger-ui/index.html#/General%20Controller/calculateCredit
link.documents.send=http://localhost:7777/swagger-ui/index.html#/General%20Controller/sendDocument
link.documents.sign=http://localhost:7777/swagger-ui/index.html#/General%20Controller/requestSignDocument
link.documents.code=http://localhost:7777/swagger-ui/index.html#/General%20Controller/signDocumentWithCode
link.documents.deny=http://localhost:7777/swagger-ui/index.html#/General%20Controller/denyApplication

text.documents.deny=\u041A\u0440\u0435\u0434\u0438\u0442\u043D\u0430\u044F \u0437\u0430\u044F\u0432\u043A\u0430 {id} \u043E\u0442\u043C\u0435\u043D\u0435\u043D\u0430. \u0421\u043F\u0430\u0441\u0438\u0431\u043E \u0437\u0430 \u043E\u0431\u0440\u0430\u0449\u0435\u043D\u0438\u0435 \u0432 \u043D\u0430\u0448 \u0431\u0430\u043D\u043A
text.documents.issue=\u041A\u0440\u0435\u0434\u0438\u0442\u043D\u0430\u044F \u0437\u0430\u044F\u0432\u043A\u0430 {id} \u0443\u0441\u043F\u0435\u0448\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u043D\u0430! \u041F\u043E\u0437\u0434\u0440\u0430\u0432\u043B\u044F\u0435\u043C \u0441 \u043E\u0444\u043E\u0440\u043C\u043B\u0435\u043D\u0438\u0435\u043C \u043A\u0440\u0435\u0434\u0438\u0442\u0430! \u0414\u0435\u043D\u044C\u0433\u0438 \u0443\u0436\u0435 \u0432 \u043F\u0443\u0442\u0438!
text.documents.code=\u041A\u043E\u0434 \u0434\u043B\u044F \u043F\u043E\u0434\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u043A\u0440\u0435\u0434\u0438\u0442\u043D\u043E\u0439 \u0437\u0430\u044F\u0432\u043A\u0438 {id} \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439: {ses}. \u0414\u0430\u043B\u0435\u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u0441\u043B\u0430\u0442\u044C \u0434\u0430\u043D\u043D\u044B\u0439 \u043A\u043E\u0434 \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435: {link}
text.documents.sign=\u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u044B \u0434\u043B\u044F \u043A\u0440\u0435\u0434\u0438\u0442\u043D\u043E\u0433\u043E \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u0438\u044F {id} \u0441\u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u044B. \u0414\u0430\u043B\u0435\u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u043F\u043E\u0434\u043F\u0438\u0441\u0430\u0442\u044C \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u044B. \u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u043F\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435: {link1} \u0415\u0441\u043B\u0438 \u0445\u043E\u0442\u0438\u0442\u0435 \u043E\u0442\u043C\u0435\u043D\u0438\u0442\u044C \u0437\u0430\u044F\u0432\u043A\u0443, \u0442\u043E \u043F\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435: {link2}
text.documents.send=\u0411\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u0438\u043C \u0412\u0430\u0441 \u0437\u0430 \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435. \u041A\u0440\u0435\u0434\u0438\u0442\u043D\u043E\u0435 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u0438\u0435 {id} \u043E\u0434\u043E\u0431\u0440\u0435\u043D\u043E. \u0414\u043B\u044F \u0444\u043E\u0440\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u043E\u0432 \u043F\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435: {link}
text.finish.registration=\u041F\u0440\u0438\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u043C \u0412\u0430\u0441 \u0432 \u0431\u0430\u043D\u043A\u0435 \u0412\u0430\u0434\u0438\u043C\u041D\u0435\u043E\u0444\u043B\u0435\u043A\u0441. \u0421\u043F\u0430\u0441\u0438\u0431\u043E \u0437\u0430 \u043E\u0444\u043E\u0440\u043C\u043B\u0435\u043D\u0438\u0435 \u0437\u0430\u044F\u0432\u043A\u0438 \u043F\u043E \u043A\u0440\u0435\u0434\u0438\u0442\u0443. \u041D\u043E\u043C\u0435\u0440 \u0432\u0430\u0448\u0435\u0439 \u0437\u0430\u044F\u0432\u043A\u0438 - {id}. \u041C\u044B \u043E\u0434\u043E\u0431\u0440\u0438\u043B\u0438 \u0412\u0430\u0448\u0435 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u043F\u043E\u0436\u0430\u043B\u0443\u0439\u0441\u0442\u0430 \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442\u0435 \u043E\u0444\u043E\u0440\u043C\u043B\u0435\u043D\u0438\u0435. \u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u043F\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435: {link}